export const pwaCollection =  {
	name: "4학년",
	areas: [
		{
			name: "1학기",
			skills: [
				{
					name: "정보보안개론",
					description: {
						text: "정보보호 기초이론, 암호 프로토콜, 프로그램 보안, 컴퓨터시스템 보안, 데이터베이스 보안, 네트워크 보안, 개인정보보호 및 법률 등 정보보안의 전체적인 기초 지식을 습득한다.",

					},

				},
				{
					name: "인공지능",
					description: {
						text: "지능 시스템의 기본 개념과 기법을 소개하고 표기 시스템과 구조의 선택 방법과 탐색 방법을 설명하고 이들의 성능 향상을 위한 방법과 기술을 연구한다.",
					}
				},
				{
					name: "빅데이터분석",
					description: {
						text: "Python을 활용하여 CSV, 엑셀, 데이터베이스의 데이터를 분석하는 방법을 학습한다. 아울러 파일 파싱, 그룹화, 통계 산출, 시각화에 필요한 각종 Python 라이브러리 활용법을 습득하여 빅데이터 분석 능력을 함양한다.",
					},

				},
				{
					name: "캡스톤디자인1",
					description: {
						text: "컴퓨터공학 전공 학생들이 학부 과정에서 배운 이론들을 종합 적용하여 제품을 기획, 설계, 제작하는 창의적 능력을 갖추도록 한다. 캡스톤 프로젝트에서는 제작하고자 하는 제품의 규모와 설계를 전공 과정에서 배운 내용 중 기본에 충실할 수 있는 것을 위주로 진행한다.",

					}
				},
				{
					name: "영상처리",
					description: {
						text: "영상 생성, 처리, 해석, 인식 등 영상과 관련된 처리 방법 및 알고리즘을 학습하고, 영상 표현을 위한 다양한 영상 포맷을 학습한다. 또한 영상처리를 위한 공개 SW와 라이브러리를 이용하여 처리하는 방법을 습득한다.",

					}
				},
				{
					name: "디지털신호처리",
					description: {
						text: "신호처리 시스템의 근간이 되는 연속시간의 영역의 해서, 푸리에 변환 이산시스템의 시간 영역해석, Z-변환 등 신호처리를 위한 기본적인 이론적 배경을 이해한다.",
					}
				},
				{
					name: "임베디드시스템 설계",
					description: {
						text: "임베디드 시스템에 대한 개념을 소개하고, 상용 프로세서(도는 마이크로컨트롤러)를 이용하여 하드웨어와 소프트웨어와의 인터페이스 역할을 할 수 있는 펌웨어(firmware)를 설계, 작성하는 방법을 소개한다. 또 이를 활용하여 간단한 운영체제를 포팅할 수 있는 능력을 기른다.",
					}
				}
			]
		},
		{
			name: "2학기",
			skills: [
				{
					name: "iot응용",
					description: {
						text: "최근 초 정보화시대에는 사물인터넷(IoT:Internet of Things)이 발전 및 응용되면서 그 이전에는 접하지 못했던 새로운 인류 생활의 패러다임(Paradigm)이 가능해지고 있으며, 향후 더욱더 가속화가 될 것이다. 본 과목에서는 이런 초 정보화시대에 첨병인 IoT에 대한 전반적인 개념을 이해하고 현재의 가치 있는(Valuable) 각종 응용사례를 이해하고, 또한 향후 차세대 IoT 분야에 대해 습득함을 교육목표로 한다.",

					},

				},
				{
					name: "병렬 및 분산시스템",
					description: {
						text: "대규모 데이터 처리를 위한 방법으로 병렬 처리와 분산 처리에 대한 개념을 소개하고, 이를 활용할 수 있도록 GPU 및 분산 처리 시스템을 이용한 프로그래밍 방법을 학습한다.",
					}
				},
				{
					name: "캡스톤디자인2",
					description: {
						text: "컴퓨터공학 전공 학생들이 학부 과정에서 배운 이론들을 종합 적용하여 제품을 기획, 설계, 제작하는 창의적 능력을 갖추도록 한다. 캡스톤 프로젝트에서는 제작하고자 하는 제품의 규모와 설계를 전공 과정에서 배운 내용 중 기본에 충실할 수 있는 것을 위주로 진행한다.",

					},

				},
				{
					name: "인간과 컴퓨터상호작용",
					description: {
						text: "인간과 컴퓨터 간의 상호작용 방법에 대한 개념을 소개하고, 컴퓨터를 좀 더 쉽고, 효과적으로 사용할 수 있는 인터페이스 방법을 학습한다. 이를 기반으로 소프트웨어 또는 하드웨어를 설계할 때 이를 활용할 수 있도록 한다.",
					}
				},
				{
					name: "시스템 분석 및 설계",
					description: {
						text: "시스템의 기능을 분석하여 자료흐름도, 자료사전, 미니명세서로 표현하고, 객체지향 분석 및 설계에서 사용되는 유즈케이스 다이어그램, 클래스다이어그램, 순서 다이어그램 등 UML 표기법에 따라 시스템을 표현함으로써 분석 및 설계명세서 개발 능력을 배양한다.",

					}
				}	
			]
		}
		
	]
}
